Internal node
Do you want an old movie?
Internal node
Do you want a popular movie?
Internal node
Do you want a grossing movie?
Internal node
Do you want a long movie?
Internal node
Do you want a movie directed by a famous director?
Internal node
Do you want a movie acted by Hollywood super stars?
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0068646 TheGodfather, ranking 2 among the top 250 movies. Its a Crime, Drama movie in 1972, directed by Francis Ford Coppola, having a runtime of 175min, and rated R.***The movie is about: The aging patriarch of an organized crime dynasty in postwar New York City transfers control of his clandestine empire to his reluctant youngest son./tt0071562 TheGodfatherPartII, ranking 4 among the top 250 movies. Its a Crime, Drama movie in 1974, directed by Francis Ford Coppola, having a runtime of 202min, and rated R.***The movie is about: The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate./
Leaf
tt0103064 Terminator2:JudgmentDay, ranking 29 among the top 250 movies. Its a Action, Sci-Fi movie in 1991, directed by James Cameron, having a runtime of 137min, and rated R.***The movie is about: A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her 10-year old adolescent son John from an even more advanced and powerful cyborg./
Leaf
None
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0110912 PulpFiction, ranking 8 among the top 250 movies. Its a Crime, Drama movie in 1994, directed by Quentin Tarantino, having a runtime of 154min, and rated R.***The movie is about: The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption./tt0099685 Goodfellas, ranking 17 among the top 250 movies. Its a Biography, Crime, Drama movie in 1990, directed by Martin Scorsese, having a runtime of 145min, and rated R.***The movie is about: The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate./tt0114369 Se7en, ranking 19 among the top 250 movies. Its a Crime, Drama, Mystery movie in 1995, directed by David Fincher, having a runtime of 127min, and rated R.***The movie is about: Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives./tt0112641 Casino, ranking 136 among the top 250 movies. Its a Crime, Drama movie in 1995, directed by Martin Scorsese, having a runtime of 178min, and rated R.***The movie is about: A tale of greed, deception, money, power, and murder occur between two best friends: a mafia enforcer and a casino executive compete against each other over a gambling empire, and over a fast-living and fast-loving socialite./
Leaf
None
Leaf
None
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0108052 Schindler'sList, ranking 6 among the top 250 movies. Its a Biography, Drama, History movie in 1993, directed by Steven Spielberg, having a runtime of 195min, and rated R.***The movie is about: In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis./tt0120815 SavingPrivateRyan, ranking 24 among the top 250 movies. Its a Drama, War movie in 1998, directed by Steven Spielberg, having a runtime of 169min, and rated R.***The movie is about: Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action./tt0078788 ApocalypseNow, ranking 53 among the top 250 movies. Its a Drama, Mystery, War movie in 1979, directed by Francis Ford Coppola, having a runtime of 147min, and rated R.***The movie is about: A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god./tt0090605 Aliens, ranking 65 among the top 250 movies. Its a Action, Adventure, Sci-Fi movie in 1986, directed by James Cameron, having a runtime of 137min, and rated R.***The movie is about: Fifty-seven years after surviving an apocalyptic attack aboard her space vessel by merciless space creatures, Officer Ripley awakens from hyper-sleep and tries to warn anyone who will listen about the predators./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0107290 JurassicPark, ranking 148 among the top 250 movies. Its a Action, Adventure, Sci-Fi movie in 1993, directed by Steven Spielberg, having a runtime of 127min, and rated PG-13.***The movie is about: A pragmatic paleontologist touring an almost complete theme park on an island in Central America is tasked with protecting a couple of kids after a power failure causes the park's cloned dinosaurs to run loose./tt0073195 Jaws, ranking 205 among the top 250 movies. Its a Adventure, Thriller movie in 1975, directed by Steven Spielberg, having a runtime of 124min, and rated PG.***The movie is about: When a killer shark unleashes chaos on a beach community off Cape Cod, it's up to a local sheriff, a marine biologist, and an old seafarer to hunt the beast down./
Internal node
Do you want an R-rated movie?
Leaf
tt0081505 TheShining, ranking 61 among the top 250 movies. Its a Drama, Horror movie in 1980, directed by Stanley Kubrick, having a runtime of 146min, and rated R.***The movie is about: A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0062622 2001:ASpaceOdyssey, ranking 91 among the top 250 movies. Its a Adventure, Sci-Fi movie in 1968, directed by Stanley Kubrick, having a runtime of 149min, and rated G.***The movie is about: After uncovering a mysterious artifact buried beneath the Lunar surface, a spacecraft is sent to Jupiter to find its origins - a spacecraft manned by two men and the supercomputer H.A.L. 9000./tt0097576 IndianaJonesandtheLastCrusade, ranking 121 among the top 250 movies. Its a Action, Adventure movie in 1989, directed by Steven Spielberg, having a runtime of 127min, and rated PG-13.***The movie is about: In 1938, after his father Professor Henry Jones, Sr. goes missing while pursuing the Holy Grail, Professor Henry "Indiana" Jones, Jr. finds himself up against Adolf Hitler's Nazis again to stop them from obtaining its powers./
Leaf
None
Internal node
Do you want a movie acted by Hollywood super stars?
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0119488 L.A.Confidential, ranking 117 among the top 250 movies. Its a Crime, Drama, Mystery movie in 1997, directed by Curtis Hanson, having a runtime of 138min, and rated R.***The movie is about: As corruption grows in 1950s Los Angeles, three policemen - one strait-laced, one brutal, and one sleazy - investigate a series of murders with their own brand of justice./
Leaf
tt0133093 TheMatrix, ranking 16 among the top 250 movies. Its a Action, Sci-Fi movie in 1999, directed by Lana Wachowski, having a runtime of 136min, and rated R.***The movie is about: When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence./tt0169547 AmericanBeauty, ranking 67 among the top 250 movies. Its a Drama movie in 1999, directed by Sam Mendes, having a runtime of 122min, and rated R.***The movie is about: A sexually frustrated suburban father has a mid-life crisis after becoming infatuated with his daughter's best friend./
Leaf
None
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0086250 Scarface, ranking 108 among the top 250 movies. Its a Crime, Drama movie in 1983, directed by Brian De Palma, having a runtime of 170min, and rated R.***The movie is about: In 1980 Miami, a determined Cuban immigrant takes over a drug cartel and succumbs to greed./tt0113277 Heat, ranking 113 among the top 250 movies. Its a Action, Crime, Drama movie in 1995, directed by Michael Mann, having a runtime of 170min, and rated R.***The movie is about: A group of high-end professional thieves start to feel the heat from the LAPD when they unknowingly leave a clue at their latest heist./
Leaf
None
Leaf
None
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0120689 TheGreenMile, ranking 27 among the top 250 movies. Its a Crime, Drama, Fantasy movie in 1999, directed by Frank Darabont, having a runtime of 189min, and rated R.***The movie is about: The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift./
Leaf
tt0073486 OneFlewOvertheCuckoo'sNest, ranking 18 among the top 250 movies. Its a Drama movie in 1975, directed by Milos Forman, having a runtime of 133min, and rated R.***The movie is about: In the Fall of 1963, a Korean War veteran and criminal pleads insanity and is admitted to a mental institution, where he rallies up the scared patients against the tyrannical nurse./tt0112573 Braveheart, ranking 76 among the top 250 movies. Its a Biography, Drama, History movie in 1995, directed by Mel Gibson, having a runtime of 178min, and rated R.***The movie is about: Scottish warrior William Wallace leads his countrymen in a rebellion to free his homeland from the tyranny of King Edward I of England./tt0119217 GoodWillHunting, ranking 81 among the top 250 movies. Its a Drama, Romance movie in 1997, directed by Gus Van Sant, having a runtime of 126min, and rated R.***The movie is about: Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life./tt0095016 DieHard, ranking 118 among the top 250 movies. Its a Action, Thriller movie in 1988, directed by John McTiernan, having a runtime of 132min, and rated R.***The movie is about: A New York City police officer tries to save his estranged wife and several others taken hostage by terrorists during a Christmas party at the Nakatomi Plaza in Los Angeles./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0109830 ForrestGump, ranking 11 among the top 250 movies. Its a Drama, Romance movie in 1994, directed by Robert Zemeckis, having a runtime of 142min, and rated PG-13.***The movie is about: The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood swe.../tt0076759 StarWars, ranking 28 among the top 250 movies. Its a Action, Adventure, Fantasy movie in 1977, directed by George Lucas, having a runtime of 121min, and rated PG.***The movie is about: Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth .../tt0086190 StarWars:EpisodeVI-ReturnoftheJedi, ranking 89 among the top 250 movies. Its a Action, Adventure, Fantasy movie in 1983, directed by Richard Marquand, having a runtime of 131min, and rated PG.***The movie is about: After a daring mission to rescue Han Solo from Jabba the Hutt, the Rebels dispatch to Endor to destroy the second Death Star. Meanwhile, Luke struggles to help Darth Vader back from the dark side without falling into the Emperor's.../
Leaf
tt0080684 StarWars:EpisodeV-TheEmpireStrikesBack, ranking 15 among the top 250 movies. Its a Action, Adventure, Fantasy movie in 1980, directed by Irvin Kershner, having a runtime of 124min, and rated PG.***The movie is about: After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued across the galaxy by Darth Vader and bounty hunter Boba Fett./
Leaf
None
Internal node
Do you want a movie directed by a famous director?
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt0082971 RaidersoftheLostArk, ranking 55 among the top 250 movies. Its a Action, Adventure movie in 1981, directed by Steven Spielberg, having a runtime of 115min, and rated PG.***The movie is about: Archaeology professor Indiana Jones ventures to seize a biblical artefact known as the Ark of the Covenant. While doing so, he puts up a fight against Renee and a troop of Nazis./
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0078748 Alien, ranking 51 among the top 250 movies. Its a Horror, Sci-Fi movie in 1979, directed by Ridley Scott, having a runtime of 117min, and rated R.***The movie is about: The crew of a commercial spacecraft encounter a deadly lifeform after investigating an unknown transmission./tt0093058 FullMetalJacket, ranking 106 among the top 250 movies. Its a Drama, War movie in 1987, directed by Stanley Kubrick, having a runtime of 116min, and rated R.***The movie is about: A pragmatic U.S. Marine observes the dehumanizing effects the Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue./
Leaf
None
Leaf
None
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
tt0075148 Rocky, ranking 211 among the top 250 movies. Its a Drama, Sport movie in 1976, directed by John G. Avildsen, having a runtime of 120min, and rated PG.***The movie is about: A small-time Philadelphia boxer gets a supremely rare chance to fight the world heavyweight champion in a bout in which he strives to go the distance for his self-respect./
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
tt0102926 TheSilenceoftheLambs, ranking 22 among the top 250 movies. Its a Crime, Drama, Thriller movie in 1991, directed by Jonathan Demme, having a runtime of 118min, and rated R.***The movie is about: A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0118799 LifeIsBeautiful, ranking 25 among the top 250 movies. Its a Comedy, Drama, Romance movie in 1997, directed by Roberto Benigni, having a runtime of 116min, and rated PG-13.***The movie is about: When an open-minded Jewish waiter and his son become victims of the Holocaust, he uses a perfect mixture of will, humor, and imagination to protect his son from the dangers around their camp./tt0110357 TheLionKing, ranking 36 among the top 250 movies. Its a Animation, Adventure, Drama movie in 1994, directed by Roger Allers, having a runtime of 88min, and rated G.***The movie is about: Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself./tt0114709 ToyStory, ranking 75 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 1995, directed by John Lasseter, having a runtime of 81min, and rated G.***The movie is about: A cowboy doll is profoundly threatened and jealous when a new spaceman action figure supplants him as top toy in a boy's bedroom./tt0120382 TheTrumanShow, ranking 140 among the top 250 movies. Its a Comedy, Drama movie in 1998, directed by Peter Weir, having a runtime of 103min, and rated PG.***The movie is about: An insurance salesman discovers his whole life is actually a reality TV show./tt0167404 TheSixthSense, ranking 141 among the top 250 movies. Its a Drama, Mystery, Thriller movie in 1999, directed by M. Night Shyamalan, having a runtime of 107min, and rated PG-13.***The movie is about: A frightened, withdrawn Philadelphia boy who communicates with spirits seeks the help of a disheartened child psychologist./
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0088763 BacktotheFuture, ranking 30 among the top 250 movies. Its a Adventure, Comedy, Sci-Fi movie in 1985, directed by Robert Zemeckis, having a runtime of 116min, and rated PG.***The movie is about: Marty McFly, a 17-year-old high school student, is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his close friend, the maverick scientist Doc Brown./tt0107048 GroundhogDay, ranking 224 among the top 250 movies. Its a Comedy, Drama, Fantasy movie in 1993, directed by Harold Ramis, having a runtime of 101min, and rated PG.***The movie is about: A narcissistic, self-centered weatherman finds himself in a time loop on Groundhog Day, and the day keeps repeating until he gets it right./
Leaf
None
Internal node
Do you want a long movie?
Internal node
Do you want a movie directed by a famous director?
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
tt0137523 FightClub, ranking 12 among the top 250 movies. Its a Drama movie in 1999, directed by David Fincher, having a runtime of 139min, and rated R.***The movie is about: An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more./
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt0066921 AClockworkOrange, ranking 102 among the top 250 movies. Its a Crime, Sci-Fi movie in 1971, directed by Stanley Kubrick, having a runtime of 136min, and rated X.***The movie is about: In the future, a sadistic gang leader is imprisoned and volunteers for a conduct-aversion experiment, but it doesn't go as planned./
Leaf
tt0060196 TheGood,theBadandtheUgly, ranking 10 among the top 250 movies. Its a Adventure, Western movie in 1966, directed by Sergio Leone, having a runtime of 178min, and rated R.***The movie is about: A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery./
Leaf
None
Leaf
tt0111161 TheShawshankRedemption, ranking 1 among the top 250 movies. Its a Drama movie in 1994, directed by Frank Darabont, having a runtime of 142min, and rated R.***The movie is about: Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency./
Internal node
Do you want a movie directed by a famous director?
Internal node
Do you want a movie acted by Hollywood super stars?
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt0075314 TaxiDriver, ranking 114 among the top 250 movies. Its a Crime, Drama movie in 1976, directed by Martin Scorsese, having a runtime of 114min, and rated R.***The movie is about: A mentally unstable veteran works as a nighttime taxi driver in New York City, where the perceived decadence and sleaze fuels his urge for violent action./
Leaf
tt0088247 TheTerminator, ranking 214 among the top 250 movies. Its a Action, Sci-Fi movie in 1984, directed by James Cameron, having a runtime of 107min, and rated R.***The movie is about: A human soldier is sent from 2029 to 1984 to stop an almost indestructible cyborg killing machine, sent from the same year, which has been programmed to execute a young woman whose unborn son is the key to humanity's future salvat.../
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0054215 Psycho, ranking 32 among the top 250 movies. Its a Horror, Mystery, Thriller movie in 1960, directed by Alfred Hitchcock, having a runtime of 109min, and rated R.***The movie is about: A Phoenix secretary embezzles $40,000 from her employer's client, goes on the run and checks into a remote motel run by a young man under the domination of his mother./tt0083658 BladeRunner, ranking 176 among the top 250 movies. Its a Action, Drama, Sci-Fi movie in 1982, directed by Ridley Scott, having a runtime of 117min, and rated R.***The movie is about: A blade runner must pursue and terminate four replicants who stole a ship in space and have returned to Earth to find their creator./
Leaf
None
Leaf
tt0105236 ReservoirDogs, ranking 93 among the top 250 movies. Its a Crime, Thriller movie in 1992, directed by Quentin Tarantino, having a runtime of 99min, and rated R.***The movie is about: When a simple jewelry heist goes horribly wrong, the surviving criminals begin to suspect that one of them is a police informant./
Leaf
None
Internal node
Do you want a movie acted by Hollywood super stars?
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt0114814 TheUsualSuspects, ranking 40 among the top 250 movies. Its a Crime, Drama, Mystery movie in 1995, directed by Bryan Singer, having a runtime of 106min, and rated R.***The movie is about: A sole survivor tells of the twisty events leading up to a horrific gun battle on a boat, which began when five criminals met at a seemingly random police lineup./
Leaf
tt0120586 AmericanHistoryX, ranking 38 among the top 250 movies. Its a Crime, Drama movie in 1998, directed by Tony Kaye, having a runtime of 119min, and rated R.***The movie is about: A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did./
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
tt0116282 Fargo, ranking 169 among the top 250 movies. Its a Crime, Thriller movie in 1996, directed by Joel Coen, having a runtime of 98min, and rated R.***The movie is about: Minnesota car salesman Jerry Lundegaard's inept crime falls apart due to his and his henchmen's bungling and the persistent police work of the quite pregnant Marge Gunderson./
Internal node
Do you want a crime movie?
Leaf
tt0050083 12AngryMen, ranking 5 among the top 250 movies. Its a Crime, Drama movie in 1957, directed by Sidney Lumet, having a runtime of 96min, and rated Approved.***The movie is about: The jury in a New York City murder trial is frustrated by a single member whose skeptical caution forces them to more carefully consider the evidence before jumping to a hasty verdict./
Leaf
tt0034583 Casablanca, ranking 43 among the top 250 movies. Its a Drama, Romance, War movie in 1942, directed by Michael Curtiz, having a runtime of 102min, and rated PG.***The movie is about: A cynical expatriate American cafe owner struggles to decide whether or not to help his former lover and her fugitive husband escape the Nazis in French Morocco./
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0110413 Léon:TheProfessional, ranking 35 among the top 250 movies. Its a Action, Crime, Drama movie in 1994, directed by Luc Besson, having a runtime of 110min, and rated R.***The movie is about: 12-year-old Mathilda is reluctantly taken in by Léon, a professional assassin, after her family is murdered. An unusual relationship forms as she becomes his protégée and learns the assassin's trade./tt0120735 Lock,StockandTwoSmokingBarrels, ranking 161 among the top 250 movies. Its a Action, Comedy, Crime movie in 1998, directed by Guy Ritchie, having a runtime of 107min, and rated R.***The movie is about: Eddy persuades his three pals to pool money for a vital poker game against a powerful local mobster, Hatchet Harry. Eddy loses, after which Harry gives him a week to pay back 500,000 pounds./tt0118715 TheBigLebowski, ranking 204 among the top 250 movies. Its a Comedy, Crime movie in 1998, directed by Joel Coen, having a runtime of 117min, and rated R.***The movie is about: Ultimate L.A. slacker Jeff "The Dude" Lebowski, mistaken for a millionaire of the same name, seeks restitution for a rug ruined by debt collectors, enlisting his bowling buddies for help while trying to find the millionaire's miss.../
Leaf
tt0117951 Trainspotting, ranking 167 among the top 250 movies. Its a Drama movie in 1996, directed by Danny Boyle, having a runtime of 93min, and rated R.***The movie is about: Renton, deeply immersed in the Edinburgh drug scene, tries to clean up and get out, despite the allure of the drugs and influence of friends./
Leaf
tt0071853 MontyPythonandtheHolyGrail, ranking 145 among the top 250 movies. Its a Adventure, Comedy, Fantasy movie in 1975, directed by Terry Gilliam, having a runtime of 91min, and rated PG.***The movie is about: King Arthur and his Knights of the Round Table embark on a surreal, low-budget search for the Holy Grail, encountering many, very silly obstacles./
Leaf
None
Internal node
Do you want a grossing movie?
Internal node
Do you want a long movie?
Internal node
Do you want a movie directed by a famous director?
Leaf
tt0105695 Unforgiven, ranking 138 among the top 250 movies. Its a Drama, Western movie in 1992, directed by Clint Eastwood, having a runtime of 130min, and rated R.***The movie is about: Retired Old West gunslinger William Munny reluctantly takes on one last job, with the help of his old partner Ned Logan and a young man, The "Schofield Kid."/
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
tt0077416 TheDeerHunter, ranking 188 among the top 250 movies. Its a Drama, War movie in 1978, directed by Michael Cimino, having a runtime of 183min, and rated R.***The movie is about: An in-depth examination of the ways in which the Vietnam War impacts and disrupts the lives of several friends in a small steel mill town in Pennsylvania./
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
tt0070047 TheExorcist, ranking 225 among the top 250 movies. Its a Horror movie in 1973, directed by William Friedkin, having a runtime of 122min, and rated R.***The movie is about: When a teenage girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter./
Internal node
Do you want a crime movie?
Leaf
tt0070735 TheSting, ranking 110 among the top 250 movies. Its a Comedy, Crime, Drama movie in 1973, directed by George Roy Hill, having a runtime of 129min, and rated PG.***The movie is about: Two grifters team up to pull off the ultimate con./
Leaf
tt0086879 Amadeus, ranking 71 among the top 250 movies. Its a Biography, Drama, Music movie in 1984, directed by Milos Forman, having a runtime of 160min, and rated PG.***The movie is about: The life, success and troubles of Wolfgang Amadeus Mozart, as told by Antonio Salieri, the contemporaneous composer who was deeply jealous of Mozart's talent and claimed to have murdered him./tt0056172 LawrenceofArabia, ranking 98 among the top 250 movies. Its a Adventure, Biography, Drama movie in 1962, directed by David Lean, having a runtime of 218min, and rated Approved.***The movie is about: The story of T.E. Lawrence, the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in order to fight the Turks./tt0031381 GonewiththeWind, ranking 158 among the top 250 movies. Its a Drama, Romance, War movie in 1939, directed by Victor Fleming, having a runtime of 238min, and rated Passed.***The movie is about: The manipulative daughter of a Georgia plantation owner conducts a turbulent romance with a roguish profiteer during the American Civil War and Reconstruction periods./tt0052618 Ben-Hur, ranking 182 among the top 250 movies. Its a Adventure, Drama movie in 1959, directed by William Wyler, having a runtime of 212min, and rated G.***The movie is about: After a Jewish prince is betrayed and sent into slavery by a Roman friend in 1st-century Jerusalem, he regains his freedom and comes back for revenge./tt0059742 TheSoundofMusic, ranking 243 among the top 250 movies. Its a Biography, Drama, Family movie in 1965, directed by Robert Wise, having a runtime of 172min, and rated G.***The movie is about: A young novitiate is sent by her convent in 1930s Austria to become a governess to the seven children of a widowed naval officer./tt0083987 Gandhi, ranking 250 among the top 250 movies. Its a Biography, Drama movie in 1982, directed by Richard Attenborough, having a runtime of 191min, and rated PG.***The movie is about: The life of the lawyer who became the famed leader of the Indian revolts against the British rule through his philosophy of nonviolent protest./
Leaf
tt0097165 DeadPoetsSociety, ranking 206 among the top 250 movies. Its a Comedy, Drama movie in 1989, directed by Peter Weir, having a runtime of 128min, and rated PG.***The movie is about: Maverick teacher John Keating uses poetry to embolden his boarding school students to new heights of self-expression./
Leaf
None
Internal node
Do you want a movie directed by a famous director?
Leaf
None
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
tt0091763 Platoon, ranking 212 among the top 250 movies. Its a Drama, War movie in 1986, directed by Oliver Stone, having a runtime of 120min, and rated R.***The movie is about: Chris Taylor, a neophyte recruit in Vietnam, finds himself caught in a battle of wills between two sergeants, one good and the other evil. A shrewd examination of the brutality of war and the duality of man in conflict./
Leaf
tt0103639 Aladdin, ranking 247 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 1992, directed by Ron Clements, having a runtime of 90min, and rated G.***The movie is about: A kindhearted street urchin and a power-hungry Grand Vizier vie for a magic lamp that has the power to make their deepest wishes come true./
Leaf
tt0092005 StandbyMe, ranking 215 among the top 250 movies. Its a Adventure, Drama movie in 1986, directed by Rob Reiner, having a runtime of 89min, and rated R.***The movie is about: After the death of one of his friends, a writer recounts a childhood journey with his friends to find the body of a missing boy./
Leaf
None
Internal node
Do you want a long movie?
Internal node
Do you want a movie directed by a famous director?
Internal node
Do you want a movie acted by Hollywood super stars?
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt0081398 RagingBull, ranking 157 among the top 250 movies. Its a Biography, Drama, Sport movie in 1980, directed by Martin Scorsese, having a runtime of 129min, and rated R.***The movie is about: The life of boxer Jake LaMotta, whose violence and temper that led him to the top in the ring destroyed his life outside of it./
Leaf
tt0087843 OnceUponaTimeinAmerica, ranking 80 among the top 250 movies. Its a Crime, Drama movie in 1984, directed by Sergio Leone, having a runtime of 229min, and rated R.***The movie is about: A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan 35 years later, where he must once again confront the ghosts and regrets of his old life./
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0038650 It'saWonderfulLife, ranking 21 among the top 250 movies. Its a Drama, Family, Fantasy movie in 1946, directed by Frank Capra, having a runtime of 130min, and rated PG.***The movie is about: An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed./tt0032553 TheGreatDictator, ranking 62 among the top 250 movies. Its a Comedy, Drama, War movie in 1940, directed by Charles Chaplin, having a runtime of 125min, and rated G.***The movie is about: Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime./tt0053125 NorthbyNorthwest, ranking 99 among the top 250 movies. Its a Action, Adventure, Mystery movie in 1959, directed by Alfred Hitchcock, having a runtime of 136min, and rated Approved.***The movie is about: A New York City advertising executive goes on the run after being mistaken for a government agent by a group of foreign spies, and falls for a woman whose loyalties he begins to doubt./tt0052357 Vertigo, ranking 100 among the top 250 movies. Its a Mystery, Romance, Thriller movie in 1958, directed by Alfred Hitchcock, having a runtime of 128min, and rated PG.***The movie is about: A former San Francisco police detective juggles wrestling with his personal demons and becoming obsessed with the hauntingly beautiful woman he has been hired to trail, who may be deeply disturbed./tt0053604 TheApartment, ranking 103 among the top 250 movies. Its a Comedy, Drama, Romance movie in 1960, directed by Billy Wilder, having a runtime of 125min, and rated Approved.***The movie is about: A Manhattan insurance clerk tries to rise in his company by letting its executives use his apartment for trysts, but complications and a romance of his own ensue./tt0072684 BarryLyndon, ranking 191 among the top 250 movies. Its a Adventure, Drama, War movie in 1975, directed by Stanley Kubrick, having a runtime of 185min, and rated PG.***The movie is about: An Irish rogue wins the heart of a rich widow and assumes her dead husband's aristocratic position in 18th-century England./tt0032976 Rebecca, ranking 235 among the top 250 movies. Its a Drama, Film-Noir, Mystery movie in 1940, directed by Alfred Hitchcock, having a runtime of 130min, and rated Approved.***The movie is about: A self-conscious woman juggles adjusting to her new role as an aristocrat's wife and avoiding being intimidated by his first wife's spectral presence./
Internal node
Do you want an R-rated movie?
Leaf
tt0059578 ForaFewDollarsMore, ranking 125 among the top 250 movies. Its a Western movie in 1965, directed by Sergio Leone, having a runtime of 132min, and rated R.***The movie is about: Two bounty hunters with the same intentions team up to track down an escaped Mexican outlaw./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0064116 OnceUponaTimeintheWest, ranking 48 among the top 250 movies. Its a Western movie in 1968, directed by Sergio Leone, having a runtime of 165min, and rated PG-13.***The movie is about: A mysterious stranger with a harmonica joins forces with a notorious desperado to protect a beautiful widow from a ruthless assassin working for the railroad./tt0053291 SomeLikeItHot, ranking 129 among the top 250 movies. Its a Comedy, Music, Romance movie in 1959, directed by Billy Wilder, having a runtime of 121min, and rated Passed.***The movie is about: After two male musicians witness a mob hit, they flee the state in an all-female band disguised as women, but further complications set in./tt0031679 Mr.SmithGoestoWashington, ranking 195 among the top 250 movies. Its a Comedy, Drama movie in 1939, directed by Frank Capra, having a runtime of 129min, and rated Passed.***The movie is about: A naive youth leader is appointed to fill a vacancy in the U.S. Senate. His idealistic plans promptly collide with corruption at home and subterfuge from his hero in Washington, but he tries to forge ahead despite attacks on his c.../
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt0047478 SevenSamurai, ranking 20 among the top 250 movies. Its a Action, Drama movie in 1954, directed by Akira Kurosawa, having a runtime of 207min, and rated Not Rated.***The movie is about: Farmers from a village exploited by bandits hire a veteran samurai for protection, who gathers six other samurai to join him. As the samurai teach the peasants how to defend themselves, the village is attacked by an army of bandits./
Internal node
Do you want an R-rated movie?
Leaf
tt0089881 Ran, ranking 135 among the top 250 movies. Its a Action, Drama, War movie in 1985, directed by Akira Kurosawa, having a runtime of 162min, and rated R.***The movie is about: In Medieval Japan, an elderly warlord retires, handing over his empire to his three sons. However, he vastly underestimates how the new-found power will corrupt them and cause them to turn on each other...and him./
Internal node
Do you want a crime movie?
Leaf
tt0057565 HighandLow, ranking 88 among the top 250 movies. Its a Crime, Drama, Mystery movie in 1963, directed by Akira Kurosawa, having a runtime of 143min, and rated Not Rated.***The movie is about: An executive of a Yokohama shoe company becomes a victim of extortion when his chauffeur's son is kidnapped by mistake and held for ransom./
Leaf
tt0119698 PrincessMononoke, ranking 79 among the top 250 movies. Its a Animation, Action, Adventure movie in 1997, directed by Hayao Miyazaki, having a runtime of 134min, and rated PG-13.***The movie is about: On a journey to find the cure for a Tatarigami's curse, Ashitaka finds himself in the middle of a war between the forest gods and Tatara, a mining colony. In this quest he also meets San, the Mononoke Hime./tt0044741 Ikiru, ranking 104 among the top 250 movies. Its a Drama movie in 1952, directed by Akira Kurosawa, having a runtime of 143min, and rated Not Rated.***The movie is about: A bureaucrat tries to find meaning in his life after he discovers he has terminal cancer./tt0071411 DersuUzala, ranking 246 among the top 250 movies. Its a Adventure, Biography, Drama movie in 1975, directed by Akira Kurosawa, having a runtime of 142min, and rated G.***The movie is about: The Russian army sends an explorer on an expedition to the snowy Siberian wilderness where he makes friends with a seasoned local hunter./
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0107207 IntheNameoftheFather, ranking 189 among the top 250 movies. Its a Biography, Crime, Drama movie in 1993, directed by Jim Sheridan, having a runtime of 133min, and rated R.***The movie is about: A man's coerced confession to an I.R.A. bombing he did not commit results in the imprisonment of his father as well. An English lawyer fights to free them./
Leaf
tt0074958 Network, ranking 220 among the top 250 movies. Its a Drama movie in 1976, directed by Sidney Lumet, having a runtime of 121min, and rated R.***The movie is about: A television network cynically exploits a deranged former anchor's ravings and revelations about the news media for its own profit, but finds that his message may be difficult to control./
Internal node
Do you want a crime movie?
Leaf
tt0056592 ToKillaMockingbird, ranking 109 among the top 250 movies. Its a Crime, Drama movie in 1962, directed by Robert Mulligan, having a runtime of 129min, and rated Approved.***The movie is about: Atticus Finch, a widowed lawyer in Depression-era Alabama, defends a black man against an undeserved rape charge, and his children against prejudice./
Leaf
tt0042192 AllAboutEve, ranking 131 among the top 250 movies. Its a Drama movie in 1950, directed by Joseph L. Mankiewicz, having a runtime of 138min, and rated Passed.***The movie is about: A seemingly timid but secretly ruthless ingénue insinuates herself into the lives of an aging Broadway star and her circle of theater friends./tt0055031 JudgmentatNuremberg, ranking 134 among the top 250 movies. Its a Drama, War movie in 1961, directed by Stanley Kramer, having a runtime of 179min, and rated Approved.***The movie is about: In 1948, an American court in occupied Germany tries four Nazis judged for war crimes./tt0040897 TheTreasureoftheSierraMadre, ranking 147 among the top 250 movies. Its a Adventure, Drama, Western movie in 1948, directed by John Huston, having a runtime of 126min, and rated Passed.***The movie is about: Two down-on-their-luck Americans searching for work in 1920s Mexico convince an old prospector to help them mine for gold in the Sierra Madre Mountains./tt0080678 TheElephantMan, ranking 155 among the top 250 movies. Its a Biography, Drama movie in 1980, directed by David Lynch, having a runtime of 124min, and rated PG.***The movie is about: A Victorian surgeon rescues a heavily disfigured man who is mistreated while scraping a living as a side-show freak. Behind his monstrous façade, there is revealed a person of kindness, intelligence and sophistication./tt0050212 TheBridgeontheRiverKwai, ranking 165 among the top 250 movies. Its a Adventure, Drama, War movie in 1957, directed by David Lean, having a runtime of 161min, and rated PG.***The movie is about: British POWs are forced to build a railway bridge across the river Kwai for their Japanese captors in occupied Burma, not knowing that the allied forces are planning a daring commando raid through the jungle to destroy it./tt0036868 TheBestYearsofOurLives, ranking 226 among the top 250 movies. Its a Drama, Romance, War movie in 1946, directed by William Wyler, having a runtime of 170min, and rated Approved.***The movie is about: Three World War II veterans, two of them traumatized or disabled, return home to the American midwest to discover that they and their families have been irreparably changed./tt0058946 TheBattleofAlgiers, ranking 229 among the top 250 movies. Its a Drama, War movie in 1966, directed by Gillo Pontecorvo, having a runtime of 121min, and rated Not Rated.***The movie is about: In the 1950s, fear and violence escalate as the people of Algiers fight for independence from the French government./tt0032551 TheGrapesofWrath, ranking 234 among the top 250 movies. Its a Drama movie in 1940, directed by John Ford, having a runtime of 129min, and rated Passed.***The movie is about: An Oklahoma family, driven off their farm by the poverty and hopelessness of the Dust Bowl, joins the westward migration to California, suffering the misfortunes of the homeless in the Great Depression./
Internal node
Do you want an R-rated movie?
Leaf
tt0071315 Chinatown, ranking 156 among the top 250 movies. Its a Drama, Mystery, Thriller movie in 1974, directed by Roman Polanski, having a runtime of 130min, and rated R.***The movie is about: A private detective hired to expose an adulterer in 1930s Los Angeles finds himself caught up in a web of deceit, corruption, and murder./
Internal node
Do you want a crime movie?
Leaf
tt0061512 CoolHandLuke, ranking 238 among the top 250 movies. Its a Crime, Drama movie in 1967, directed by Stuart Rosenberg, having a runtime of 127min, and rated GP.***The movie is about: A laid back Southern man is sentenced to two years in a rural prison, but refuses to conform./
Leaf
tt0017136 Metropolis, ranking 116 among the top 250 movies. Its a Drama, Sci-Fi movie in 1927, directed by Fritz Lang, having a runtime of 153min, and rated Not Rated.***The movie is about: In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working-class prophet who predicts the coming of a savior to mediate their differences./tt0057115 TheGreatEscape, ranking 149 among the top 250 movies. Its a Adventure, Drama, History movie in 1963, directed by John Sturges, having a runtime of 172min, and rated Approved.***The movie is about: Allied prisoners of war plan for several hundred of their number to escape from a German camp during World War II./tt0046268 TheWagesofFear, ranking 192 among the top 250 movies. Its a Adventure, Drama, Thriller movie in 1953, directed by Henri-Georges Clouzot, having a runtime of 131min, and rated Not Rated.***The movie is about: In a decrepit South American village, four men are hired to transport an urgent nitroglycerine shipment without the equipment that would make it safe./tt0046438 TokyoStory, ranking 208 among the top 250 movies. Its a Drama movie in 1953, directed by Yasujirô Ozu, having a runtime of 136min, and rated Not Rated.***The movie is about: An old couple visit their children and grandchildren in the city, but receive little attention./
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt0082096 TheBoat, ranking 77 among the top 250 movies. Its a Drama, War movie in 1981, directed by Wolfgang Petersen, having a runtime of 149min, and rated R.***The movie is about: A German U-boat stalks the frigid waters of the North Atlantic as its young crew experience the sheer terror and claustrophobic life of a submariner in World War II./
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0056058 Harakiri, ranking 44 among the top 250 movies. Its a Action, Drama, Mystery movie in 1962, directed by Masaki Kobayashi, having a runtime of 133min, and rated Not Rated.***The movie is about: When a ronin requesting seppuku at a feudal lord's palace is told of the brutal suicide of another ronin who previously visited, he reveals how their pasts are intertwined - and in doing so challenges the clan's integrity./tt0095765 CinemaParadiso, ranking 50 among the top 250 movies. Its a Drama, Romance movie in 1988, directed by Giuseppe Tornatore, having a runtime of 155min, and rated PG.***The movie is about: A filmmaker recalls his childhood when falling in love with the pictures at the cinema of his home village and forms a deep friendship with the cinema's projectionist./tt0091251 ComeandSee, ranking 95 among the top 250 movies. Its a Drama, Thriller, War movie in 1985, directed by Elem Klimov, having a runtime of 142min, and rated Not Rated.***The movie is about: After finding an old rifle, a young boy joins the Soviet resistance movement against ruthless German forces and experiences the horrors of World War II./tt0048473 PatherPanchali, ranking 219 among the top 250 movies. Its a Drama movie in 1955, directed by Satyajit Ray, having a runtime of 125min, and rated Not Rated.***The movie is about: Impoverished priest Harihar Ray, dreaming of a better life for himself and his family, leaves his rural Bengal village in search of work./
Internal node
Do you want a movie directed by a famous director?
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
tt0051201 WitnessfortheProsecution, ranking 64 among the top 250 movies. Its a Crime, Drama, Mystery movie in 1957, directed by Billy Wilder, having a runtime of 116min, and rated Approved.***The movie is about: A veteran British barrister must defend his client in a murder trial that has surprise after surprise./tt0036775 DoubleIndemnity, ranking 105 among the top 250 movies. Its a Crime, Drama, Film-Noir movie in 1944, directed by Billy Wilder, having a runtime of 107min, and rated Passed.***The movie is about: A Los Angeles insurance representative lets an alluring housewife seduce him into a scheme of insurance fraud and murder that arouses the suspicion of his colleague, an insurance investigator./
Leaf
tt0047396 RearWindow, ranking 49 among the top 250 movies. Its a Mystery, Thriller movie in 1954, directed by Alfred Hitchcock, having a runtime of 112min, and rated PG.***The movie is about: A wheelchair-bound photographer spies on his neighbors from his Greenwich Village courtyard apartment window, and becomes convinced one of them has committed murder, despite the skepticism of his fashion-model girlfriend./tt0043014 SunsetBlvd., ranking 59 among the top 250 movies. Its a Drama, Film-Noir movie in 1950, directed by Billy Wilder, having a runtime of 110min, and rated Passed.***The movie is about: A screenwriter develops a dangerous relationship with a faded film star determined to make a triumphant return./tt0057012 Dr.Strangeloveor:HowILearnedtoStopWorryingandLovetheBomb, ranking 68 among the top 250 movies. Its a Comedy, War movie in 1964, directed by Stanley Kubrick, having a runtime of 95min, and rated PG.***The movie is about: An insane American general orders a bombing attack on the Soviet Union, triggering a path to nuclear holocaust that a war room full of politicians and generals frantically tries to stop./tt0015864 TheGoldRush, ranking 177 among the top 250 movies. Its a Adventure, Comedy, Drama movie in 1925, directed by Charles Chaplin, having a runtime of 95min, and rated Passed.***The movie is about: A prospector goes to the Klondike during the 1890s gold rush in hopes of making his fortune, and is smitten with a girl he sees in a dance hall./tt0025316 ItHappenedOneNight, ranking 241 among the top 250 movies. Its a Comedy, Romance movie in 1934, directed by Frank Capra, having a runtime of 105min, and rated Passed.***The movie is about: A renegade reporter trailing a young runaway heiress for a big story joins her on a bus heading from Florida to New York, and they end up stuck with each other when the bus leaves them behind at one of the stops./
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
tt0046912 DialMforMurder, ranking 162 among the top 250 movies. Its a Crime, Thriller movie in 1954, directed by Alfred Hitchcock, having a runtime of 105min, and rated PG.***The movie is about: A former tennis star arranges the murder of his adulterous wife./
Leaf
tt0027977 ModernTimes, ranking 47 among the top 250 movies. Its a Comedy, Drama, Romance movie in 1936, directed by Charles Chaplin, having a runtime of 87min, and rated G.***The movie is about: The Tramp struggles to live in modern industrial society with the help of a young homeless woman./tt0021749 CityLights, ranking 52 among the top 250 movies. Its a Comedy, Drama, Romance movie in 1931, directed by Charles Chaplin, having a runtime of 87min, and rated G.***The movie is about: With the aid of a wealthy erratic tippler, a dewy-eyed tramp who has fallen in love with a sightless flower girl accumulates money to be able to help her medically./tt0050825 PathsofGlory, ranking 60 among the top 250 movies. Its a Drama, War movie in 1957, directed by Stanley Kubrick, having a runtime of 88min, and rated Approved.***The movie is about: After refusing to attack an enemy position, a general accuses the soldiers of cowardice and their commanding officer must defend them./tt0012349 TheKid, ranking 128 among the top 250 movies. Its a Comedy, Drama, Family movie in 1921, directed by Charles Chaplin, having a runtime of 68min, and rated Passed.***The movie is about: The Tramp cares for an abandoned child, but events put their relationship in jeopardy./tt0060827 Persona, ranking 242 among the top 250 movies. Its a Drama, Thriller movie in 1966, directed by Ingmar Bergman, having a runtime of 83min, and rated Not Rated.***The movie is about: A nurse is put in charge of a mute actress and finds that their personae are melding together./tt0129167 TheIronGiant, ranking 248 among the top 250 movies. Its a Animation, Action, Adventure movie in 1999, directed by Brad Bird, having a runtime of 86min, and rated PG.***The movie is about: A young boy befriends a giant robot from outer space that a paranoid government agent wants to destroy./
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
None
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
tt0042876 Rashomon, ranking 150 among the top 250 movies. Its a Crime, Drama, Mystery movie in 1950, directed by Akira Kurosawa, having a runtime of 88min, and rated Not Rated.***The movie is about: The rape of a bride and the murder of her samurai husband are recalled from the perspectives of a bandit, the bride, the samurai's ghost and a woodcutter./
Leaf
tt0055630 Yojimbo, ranking 144 among the top 250 movies. Its a Action, Drama, Thriller movie in 1961, directed by Akira Kurosawa, having a runtime of 110min, and rated Not Rated.***The movie is about: A crafty ronin comes to a town divided by two criminal gangs and decides to play them against each other to free the town./tt0096283 MyNeighborTotoro, ranking 172 among the top 250 movies. Its a Animation, Comedy, Family movie in 1988, directed by Hayao Miyazaki, having a runtime of 86min, and rated G.***The movie is about: When two girls move to the country to be near their ailing mother, they have adventures with the wondrous forest spirits who live nearby./tt0050986 WildStrawberries, ranking 183 among the top 250 movies. Its a Drama, Romance movie in 1957, directed by Ingmar Bergman, having a runtime of 91min, and rated Not Rated.***The movie is about: After living a life marked by coldness, an aging professor is forced to confront the emptiness of his existence./tt0050976 TheSeventhSeal, ranking 198 among the top 250 movies. Its a Drama, Fantasy movie in 1957, directed by Ingmar Bergman, having a runtime of 96min, and rated Not Rated.***The movie is about: A knight returning to Sweden after the Crusades seeks answers about life, death, and the existence of God as he plays chess against the Grim Reaper during the Black Plague./
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
tt0047296 OntheWaterfront, ranking 178 among the top 250 movies. Its a Crime, Drama, Thriller movie in 1954, directed by Elia Kazan, having a runtime of 108min, and rated Approved.***The movie is about: An ex-prize fighter turned New Jersey longshoreman struggles to stand up to his corrupt union bosses, including his older brother, as he starts to connect with the grieving sister of one of the syndicate's victims./
Leaf
tt0045152 Singin'intheRain, ranking 86 among the top 250 movies. Its a Comedy, Musical, Romance movie in 1952, directed by Stanley Donen, having a runtime of 103min, and rated G.***The movie is about: A silent film star falls for a chorus girl just as he and his delusionally jealous screen partner are trying to make the difficult transition to talking pictures in 1920s Hollywood./tt0032138 TheWizardofOz, ranking 222 among the top 250 movies. Its a Adventure, Family, Fantasy movie in 1939, directed by Victor Fleming, having a runtime of 102min, and rated G.***The movie is about: Young Dorothy Gale and her dog Toto are swept away by a tornado from their Kansas farm to the magical Land of Oz, and embark on a quest with three new friends to see the Wizard, who can return her to her home and fulfill the other.../
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0084787 TheThing, ranking 154 among the top 250 movies. Its a Horror, Mystery, Sci-Fi movie in 1982, directed by John Carpenter, having a runtime of 109min, and rated R.***The movie is about: A research team in Antarctica is hunted by a shape-shifting alien that assumes the appearance of its victims./tt0112471 BeforeSunrise, ranking 179 among the top 250 movies. Its a Drama, Romance movie in 1995, directed by Richard Linklater, having a runtime of 101min, and rated R.***The movie is about: A young man and woman meet on a train in Europe, and wind up spending one evening together in Vienna. Unfortunately, both know that this will probably be their only night together./tt0079470 LifeofBrian, ranking 244 among the top 250 movies. Its a Comedy movie in 1979, directed by Terry Jones, having a runtime of 94min, and rated R.***The movie is about: Born on the original Christmas in the stable next door to Jesus Christ, Brian of Nazareth spends his life being mistaken for a messiah./
Internal node
Do you want a crime movie?
Leaf
tt0053198 The400Blows, ranking 239 among the top 250 movies. Its a Crime, Drama movie in 1959, directed by François Truffaut, having a runtime of 99min, and rated Not Rated.***The movie is about: A young boy, left without attention, delves into a life of petty crime./
Leaf
tt0033467 CitizenKane, ranking 96 among the top 250 movies. Its a Drama, Mystery movie in 1941, directed by Orson Welles, having a runtime of 119min, and rated PG.***The movie is about: Following the death of publishing tycoon Charles Foster Kane, reporters scramble to uncover the meaning of his final utterance: 'Rosebud.'/tt0040522 BicycleThieves, ranking 120 among the top 250 movies. Its a Drama movie in 1948, directed by Vittorio De Sica, having a runtime of 89min, and rated Not Rated.***The movie is about: In post-war Italy, a working-class man's bicycle is stolen, endangering his efforts to find work. He and his son set out to find it./tt0041959 TheThirdMan, ranking 185 among the top 250 movies. Its a Film-Noir, Mystery, Thriller movie in 1949, directed by Carol Reed, having a runtime of 93min, and rated Approved.***The movie is about: Pulp novelist Holly Martins travels to shadowy, postwar Vienna, only to find himself investigating the mysterious death of an old friend, Harry Lime./tt0015324 SherlockJr., ranking 194 among the top 250 movies. Its a Action, Comedy, Romance movie in 1924, directed by Buster Keaton, having a runtime of 45min, and rated Passed.***The movie is about: A film projectionist longs to be a detective, and puts his meagre skills to work when he is framed by a rival for stealing his girlfriend's father's pocketwatch./tt0035446 ToBeorNottoBe, ranking 228 among the top 250 movies. Its a Comedy, Romance, War movie in 1942, directed by Ernst Lubitsch, having a runtime of 99min, and rated Passed.***The movie is about: During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy./
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
None
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
tt0022100 M, ranking 97 among the top 250 movies. Its a Crime, Mystery, Thriller movie in 1931, directed by Fritz Lang, having a runtime of 99min, and rated Passed.***The movie is about: When the police in a German city are unable to catch a child-murderer, other criminals join in the manhunt./tt0113247 Lahaine, ranking 231 among the top 250 movies. Its a Crime, Drama movie in 1995, directed by Mathieu Kassovitz, having a runtime of 98min, and rated Not Rated.***The movie is about: 24 hours in the lives of three young men in the French suburbs the day after a violent riot./
Leaf
tt0095327 GraveoftheFireflies, ranking 45 among the top 250 movies. Its a Animation, Drama, War movie in 1988, directed by Isao Takahata, having a runtime of 89min, and rated Not Rated.***The movie is about: A young boy and his little sister struggle to survive in Japan during World War II./tt0118849 ChildrenofHeaven, ranking 175 among the top 250 movies. Its a Drama, Family, Sport movie in 1997, directed by Majid Majidi, having a runtime of 89min, and rated PG.***The movie is about: After a boy loses his sister's pair of shoes, he goes on a series of adventures in order to find them. When he can't, he tries a new way to "win" a new pair./tt0017925 TheGeneral, ranking 186 among the top 250 movies. Its a Action, Adventure, Comedy movie in 1926, directed by Clyde Bruckman, having a runtime of 67min, and rated Passed.***The movie is about: After being rejected by the Confederate military, not realizing it was due to his crucial civilian role, an engineer must single-handedly recapture his beloved locomotive after it is seized by Union spies and return it through ene.../tt0019254 ThePassionofJoanofArc, ranking 207 among the top 250 movies. Its a Biography, Drama, History movie in 1928, directed by Carl Theodor Dreyer, having a runtime of 114min, and rated Passed.***The movie is about: In 1431, Jeanne d'Arc is placed on trial on charges of heresy. The ecclesiastical jurists attempt to force Jeanne to recant her claims of holy visions./
Internal node
Do you want a popular movie?
Internal node
Do you want a grossing movie?
Internal node
Do you want a long movie?
Internal node
Do you want a movie directed by a famous director?
Internal node
Do you want a movie acted by Hollywood super stars?
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0407887 TheDeparted, ranking 39 among the top 250 movies. Its a Crime, Drama, Thriller movie in 2006, directed by Martin Scorsese, having a runtime of 151min, and rated R.***The movie is about: An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston./tt0993846 TheWolfofWallStreet, ranking 133 among the top 250 movies. Its a Biography, Comedy, Crime movie in 2013, directed by Martin Scorsese, having a runtime of 180min, and rated R.***The movie is about: Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption and the federal government./
Leaf
tt0172495 Gladiator, ranking 37 among the top 250 movies. Its a Action, Adventure, Drama movie in 2000, directed by Ridley Scott, having a runtime of 155min, and rated R.***The movie is about: A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery./
Internal node
Do you want a crime movie?
Leaf
tt0468569 TheDarkKnight, ranking 3 among the top 250 movies. Its a Action, Crime, Drama movie in 2008, directed by Christopher Nolan, having a runtime of 152min, and rated PG-13.***The movie is about: When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice./tt0264464 CatchMeIfYouCan, ranking 173 among the top 250 movies. Its a Biography, Crime, Drama movie in 2002, directed by Steven Spielberg, having a runtime of 141min, and rated PG-13.***The movie is about: Barely 21 yet, Frank is a skilled forger who has passed as a doctor, lawyer and pilot. FBI agent Carl becomes obsessed with tracking down the con man, who only revels in the pursuit./
Leaf
tt1375666 Inception, ranking 14 among the top 250 movies. Its a Action, Adventure, Sci-Fi movie in 2010, directed by Christopher Nolan, having a runtime of 148min, and rated PG-13.***The movie is about: A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster./tt0482571 ThePrestige, ranking 41 among the top 250 movies. Its a Drama, Mystery, Sci-Fi movie in 2006, directed by Christopher Nolan, having a runtime of 130min, and rated PG-13.***The movie is about: After a tragic accident, two stage magicians in 1890s London engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other./
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0361748 InglouriousBasterds, ranking 72 among the top 250 movies. Its a Adventure, Drama, War movie in 2009, directed by Quentin Tarantino, having a runtime of 153min, and rated R.***The movie is about: In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same./tt1130884 ShutterIsland, ranking 143 among the top 250 movies. Its a Mystery, Thriller movie in 2010, directed by Martin Scorsese, having a runtime of 138min, and rated R.***The movie is about: In 1954, a U.S. Marshal investigates the disappearance of a murderer who escaped from a hospital for the criminally insane./
Internal node
Do you want a crime movie?
Leaf
tt0372784 BatmanBegins, ranking 127 among the top 250 movies. Its a Action, Crime, Drama movie in 2005, directed by Christopher Nolan, having a runtime of 140min, and rated PG-13.***The movie is about: After training with his mentor, Batman begins his fight to free crime-ridden Gotham City from corruption./
Leaf
tt1345836 TheDarkKnightRises, ranking 69 among the top 250 movies. Its a Action, Drama movie in 2012, directed by Christopher Nolan, having a runtime of 164min, and rated PG-13.***The movie is about: Eight years after the Joker's reign of anarchy, Batman, with the help of the enigmatic Selina Kyle, is forced from his exile to save Gotham City from the brutal guerrilla terrorist Bane./
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
tt1853728 DjangoUnchained, ranking 56 among the top 250 movies. Its a Drama, Western movie in 2012, directed by Quentin Tarantino, having a runtime of 165min, and rated R.***The movie is about: With the help of a German bounty-hunter, a freed slave sets out to rescue his wife from a brutal plantation-owner in Mississippi./
Leaf
tt0405159 MillionDollarBaby, ranking 174 among the top 250 movies. Its a Drama, Sport movie in 2004, directed by Clint Eastwood, having a runtime of 132min, and rated PG-13.***The movie is about: A determined woman works with a hardened boxing trainer to become a professional./
Internal node
Do you want an R-rated movie?
Leaf
tt2267998 GoneGirl, ranking 184 among the top 250 movies. Its a Drama, Mystery, Thriller movie in 2014, directed by David Fincher, having a runtime of 149min, and rated R.***The movie is about: With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent./
Leaf
tt0816692 Interstellar, ranking 26 among the top 250 movies. Its a Adventure, Drama, Sci-Fi movie in 2014, directed by Christopher Nolan, having a runtime of 169min, and rated PG-13.***The movie is about: A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival./
Leaf
None
Internal node
Do you want a movie acted by Hollywood super stars?
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
tt7286456 Joker, ranking 73 among the top 250 movies. Its a Crime, Drama, Thriller movie in 2019, directed by Todd Phillips, having a runtime of 122min, and rated R.***The movie is about: A mentally troubled stand-up comedian embarks on a downward spiral that leads to the creation of an iconic villain./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0268978 ABeautifulMind, ranking 142 among the top 250 movies. Its a Biography, Drama movie in 2001, directed by Ron Howard, having a runtime of 135min, and rated PG-13.***The movie is about: After John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish./tt0325980 PiratesoftheCaribbean:TheCurseoftheBlackPearl, ranking 233 among the top 250 movies. Its a Action, Adventure, Fantasy movie in 2003, directed by Gore Verbinski, having a runtime of 143min, and rated PG-13.***The movie is about: Blacksmith Will Turner teams up with eccentric pirate "Captain" Jack Sparrow to save his love, the governor's daughter, from Jack's former pirate allies, who are now undead./
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt1392214 Prisoners, ranking 171 among the top 250 movies. Its a Crime, Drama, Mystery movie in 2013, directed by Denis Villeneuve, having a runtime of 153min, and rated R.***The movie is about: When Keller Dover's daughter and her friend go missing, he takes matters into his own hands as the police pursue multiple leads and the pressure mounts./
Leaf
tt3315342 Logan, ranking 216 among the top 250 movies. Its a Action, Drama, Sci-Fi movie in 2017, directed by James Mangold, having a runtime of 137min, and rated R.***The movie is about: In a future where mutants are nearly extinct, an elderly and weary Logan leads a quiet life. But when Laura, a mutant child pursued by scientists, comes to him for help, he must get her to safety./
Leaf
None
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0477348 NoCountryforOldMen, ranking 152 among the top 250 movies. Its a Crime, Drama, Thriller movie in 2007, directed by Ethan Coen, having a runtime of 122min, and rated R.***The movie is about: Violence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong and more than two million dollars in cash near the Rio Grande./
Leaf
tt6751668 Parasite, ranking 34 among the top 250 movies. Its a Drama, Thriller movie in 2019, directed by Bong Joon Ho, having a runtime of 132min, and rated R.***The movie is about: Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan./tt0469494 ThereWillBeBlood, ranking 139 among the top 250 movies. Its a Drama movie in 2007, directed by Paul Thomas Anderson, having a runtime of 158min, and rated R.***The movie is about: A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business./tt2024544 12YearsaSlave, ranking 180 among the top 250 movies. Its a Biography, Drama, History movie in 2013, directed by Steve McQueen, having a runtime of 134min, and rated R.***The movie is about: In the antebellum United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery./tt2119532 HacksawRidge, ranking 193 among the top 250 movies. Its a Biography, Drama, History movie in 2016, directed by Mel Gibson, having a runtime of 139min, and rated R.***The movie is about: World War II American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people and becomes the first man in American history to receive the Medal of Honor without firing a shot./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0167260 TheLordoftheRings:TheReturnoftheKing, ranking 7 among the top 250 movies. Its a Action, Adventure, Drama movie in 2003, directed by Peter Jackson, having a runtime of 201min, and rated PG-13.***The movie is about: Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring./tt0120737 TheLordoftheRings:TheFellowshipoftheRing, ranking 9 among the top 250 movies. Its a Action, Adventure, Drama movie in 2001, directed by Peter Jackson, having a runtime of 178min, and rated PG-13.***The movie is about: A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron./tt0167261 TheLordoftheRings:TheTwoTowers, ranking 13 among the top 250 movies. Its a Action, Adventure, Drama movie in 2002, directed by Peter Jackson, having a runtime of 179min, and rated PG-13.***The movie is about: While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard./tt1201607 HarryPotterandtheDeathlyHallows:Part2, ranking 181 among the top 250 movies. Its a Adventure, Family, Fantasy movie in 2011, directed by David Yates, having a runtime of 130min, and rated PG-13.***The movie is about: Harry, Ron, and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts./
Internal node
Do you want an R-rated movie?
Leaf
tt0434409 VforVendetta, ranking 159 among the top 250 movies. Its a Action, Drama, Sci-Fi movie in 2005, directed by James McTeigue, having a runtime of 132min, and rated R.***The movie is about: In a future British dystopian society, a shadowy freedom fighter, known only by the alias of "V", plots to overthrow the tyrannical government - with the help of a young woman./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt4154756 Avengers:InfinityWar, ranking 63 among the top 250 movies. Its a Action, Adventure, Sci-Fi movie in 2018, directed by Anthony Russo, having a runtime of 149min, and rated PG-13.***The movie is about: The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe./tt4154796 Avengers:Endgame, ranking 78 among the top 250 movies. Its a Action, Adventure, Drama movie in 2019, directed by Anthony Russo, having a runtime of 181min, and rated PG-13.***The movie is about: After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to reverse Thanos' actions and restore balance to the universe./tt10872600 Spider-Man:NoWayHome, ranking 146 among the top 250 movies. Its a Action, Adventure, Fantasy movie in 2021, directed by Jon Watts, having a runtime of 148min, and rated PG-13.***The movie is about: With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to discover what it truly means to be Spider-Man./
Leaf
None
Internal node
Do you want a movie directed by a famous director?
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt1049413 Up, ranking 112 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 2009, directed by Pete Docter, having a runtime of 96min, and rated PG.***The movie is about: 78-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway./tt0317705 TheIncredibles, ranking 227 among the top 250 movies. Its a Animation, Action, Adventure movie in 2004, directed by Brad Bird, having a runtime of 115min, and rated PG.***The movie is about: While trying to lead a quiet suburban life, a family of undercover superheroes are forced into action to save the world./
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0266697 KillBill:Vol.1, ranking 151 among the top 250 movies. Its a Action, Crime, Drama movie in 2003, directed by Quentin Tarantino, having a runtime of 111min, and rated R.***The movie is about: After awakening from a four-year coma, a former assassin wreaks vengeance on the team of assassins who betrayed her./
Leaf
tt1205489 GranTorino, ranking 170 among the top 250 movies. Its a Drama movie in 2008, directed by Clint Eastwood, having a runtime of 116min, and rated R.***The movie is about: Disgruntled Korean War veteran Walt Kowalski sets out to reform his neighbor, Thao Lor, a Hmong teenager who tried to steal Kowalski's prized possession: a 1972 Gran Torino./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt2096673 InsideOut, ranking 160 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 2015, directed by Pete Docter, having a runtime of 95min, and rated PG.***The movie is about: After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school./tt0198781 Monsters,Inc., ranking 203 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 2001, directed by Pete Docter, having a runtime of 92min, and rated G.***The movie is about: In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, two monsters realize things may not be what they think./tt0382932 Ratatouille, ranking 217 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 2007, directed by Brad Bird, having a runtime of 111min, and rated G.***The movie is about: A rat who can cook makes an unusual alliance with a young kitchen worker at a famous Paris restaurant./
Leaf
None
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt5027774 ThreeBillboardsOutsideEbbing,Missouri, ranking 166 among the top 250 movies. Its a Comedy, Crime, Drama movie in 2017, directed by Martin McDonagh, having a runtime of 115min, and rated R.***The movie is about: A mother personally challenges the local authorities to solve her daughter's murder when they fail to catch the culprit./tt2278388 TheGrandBudapestHotel, ranking 187 among the top 250 movies. Its a Adventure, Comedy, Crime movie in 2014, directed by Wes Anderson, having a runtime of 99min, and rated R.***The movie is about: A writer encounters the owner of an aging high-class hotel, who tells him of his early years serving as a lobby boy in the hotel's glorious years under an exceptional concierge./
Leaf
tt8579674 1917, ranking 123 among the top 250 movies. Its a Action, Drama, War movie in 2019, directed by Sam Mendes, having a runtime of 119min, and rated R.***The movie is about: April 6th, 1917. As an infantry battalion assembles to wage war deep in enemy territory, two soldiers are assigned to race against time and deliver a message that will stop 1,600 men from walking straight into a deadly trap./tt1392190 MadMax:FuryRoad, ranking 199 among the top 250 movies. Its a Action, Adventure, Sci-Fi movie in 2015, directed by George Miller, having a runtime of 120min, and rated R.***The movie is about: In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search for her homeland with the aid of a group of female prisoners, a psychotic worshiper, and a drifter named Max./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt2380307 Coco, ranking 74 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 2017, directed by Lee Unkrich, having a runtime of 105min, and rated PG.***The movie is about: Aspiring musician Miguel, confronted with his family's ancestral ban on music, enters the Land of the Dead to find his great-great-grandfather, a legendary singer./tt0435761 ToyStory3, ranking 87 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 2010, directed by Lee Unkrich, having a runtime of 103min, and rated G.***The movie is about: The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home./tt0892769 HowtoTrainYourDragon, ranking 202 among the top 250 movies. Its a Animation, Action, Adventure movie in 2010, directed by Dean DeBlois, having a runtime of 98min, and rated PG.***The movie is about: A hapless young Viking who aspires to hunt dragons becomes the unlikely friend of a young dragon himself, and learns there may be more to the creatures than he assumed./
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0910970 WALL·E, ranking 57 among the top 250 movies. Its a Animation, Adventure, Family movie in 2008, directed by Andrew Stanton, having a runtime of 98min, and rated G.***The movie is about: In the distant future, a small waste-collecting robot inadvertently embarks on a space journey that will ultimately decide the fate of mankind./tt4633694 Spider-Man:IntotheSpider-Verse, ranking 66 among the top 250 movies. Its a Animation, Action, Adventure movie in 2018, directed by Bob Persichetti, having a runtime of 117min, and rated PG.***The movie is about: Teen Miles Morales becomes the Spider-Man of his universe, and must join with five spider-powered individuals from other dimensions to stop a threat for all realities./tt0266543 FindingNemo, ranking 153 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 2003, directed by Andrew Stanton, having a runtime of 100min, and rated G.***The movie is about: After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home./
Leaf
None
Internal node
Do you want a long movie?
Internal node
Do you want a movie directed by a famous director?
Leaf
tt0245429 SpiritedAway, ranking 31 among the top 250 movies. Its a Animation, Adventure, Family movie in 2001, directed by Hayao Miyazaki, having a runtime of 125min, and rated PG.***The movie is about: During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts./
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0253474 ThePianist, ranking 33 among the top 250 movies. Its a Biography, Drama, Music movie in 2002, directed by Roman Polanski, having a runtime of 150min, and rated R.***The movie is about: A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II./tt0211915 Amélie, ranking 101 among the top 250 movies. Its a Comedy, Romance movie in 2001, directed by Jean-Pierre Jeunet, having a runtime of 122min, and rated R.***The movie is about: Amélie is an innocent and naive girl in Paris with her own sense of justice. She decides to help those around her and, along the way, discovers love./tt0758758 IntotheWild, ranking 221 among the top 250 movies. Its a Adventure, Biography, Drama movie in 2007, directed by Sean Penn, having a runtime of 148min, and rated R.***The movie is about: After graduating from Emory University, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity and hitchhikes to Alaska to live in the wilderness. Along the way.../
Leaf
None
Leaf
None
Leaf
tt0317248 CityofGod, ranking 23 among the top 250 movies. Its a Crime, Drama movie in 2002, directed by Fernando Meirelles, having a runtime of 130min, and rated R.***The movie is about: In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin./
Internal node
Do you want a movie directed by a famous director?
Leaf
tt0209144 Memento, ranking 54 among the top 250 movies. Its a Mystery, Thriller movie in 2000, directed by Christopher Nolan, having a runtime of 113min, and rated R.***The movie is about: A man with short-term memory loss attempts to track down his wife's murderer./
Internal node
Do you want a movie acted by Hollywood super stars?
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
None
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
tt0208092 Snatch, ranking 119 among the top 250 movies. Its a Comedy, Crime movie in 2000, directed by Guy Ritchie, having a runtime of 102min, and rated R.***The movie is about: Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers and supposedly Jewish jewelers fight to track down a priceless stolen diamond./
Leaf
tt0338013 EternalSunshineoftheSpotlessMind, ranking 92 among the top 250 movies. Its a Drama, Romance, Sci-Fi movie in 2004, directed by Michel Gondry, having a runtime of 108min, and rated R.***The movie is about: When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories for ever./
Leaf
None
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt2582802 Whiplash, ranking 42 among the top 250 movies. Its a Drama, Music movie in 2014, directed by Damien Chazelle, having a runtime of 106min, and rated R.***The movie is about: A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing to realize a student's potential./
Internal node
Do you want an R-rated movie?
Leaf
tt1675434 TheIntouchables, ranking 46 among the top 250 movies. Its a Biography, Comedy, Drama movie in 2011, directed by Olivier Nakache, having a runtime of 112min, and rated R.***The movie is about: After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver./
Leaf
tt0180093 RequiemforaDream, ranking 84 among the top 250 movies. Its a Drama movie in 2000, directed by Darren Aronofsky, having a runtime of 102min, and rated Unrated.***The movie is about: The drug-induced utopias of four Coney Island people are shattered when their addictions run deep./
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt0457430 Pan'sLabyrinth, ranking 137 among the top 250 movies. Its a Drama, Fantasy, War movie in 2006, directed by Guillermo del Toro, having a runtime of 118min, and rated R.***The movie is about: In the Falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world./
Leaf
tt0364569 Oldboy, ranking 70 among the top 250 movies. Its a Action, Drama, Mystery movie in 2003, directed by Park Chan-wook, having a runtime of 120min, and rated R.***The movie is about: After being kidnapped and imprisoned for fifteen years, Oh Dae-Su is released, only to find that he must find his captor in five days./
Internal node
Do you want a grossing movie?
Internal node
Do you want a long movie?
Internal node
Do you want a movie directed by a famous director?
Leaf
None
Internal node
Do you want a movie acted by Hollywood super stars?
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt1950186 FordvFerrari, ranking 210 among the top 250 movies. Its a Action, Biography, Drama movie in 2019, directed by James Mangold, having a runtime of 152min, and rated PG-13.***The movie is about: American car designer Carroll Shelby and driver Ken Miles battle corporate interference and the laws of physics to build a revolutionary race car for Ford in order to defeat Ferrari at the 24 Hours of Le Mans in 1966./
Leaf
tt1745960 TopGun:Maverick, ranking 83 among the top 250 movies. Its a Action, Drama movie in 2022, directed by Joseph Kosinski, having a runtime of 130min, and rated PG-13.***The movie is about: After thirty years, Maverick is still pushing the envelope as a top naval aviator, but must confront ghosts of his past when he leads TOP GUN's elite graduates on a mission that demands the ultimate sacrifice from those chosen to .../
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Internal node
Do you want an R-rated movie?
Leaf
tt1895587 Spotlight, ranking 213 among the top 250 movies. Its a Biography, Crime, Drama movie in 2015, directed by Tom McCarthy, having a runtime of 129min, and rated R.***The movie is about: The true story of how the Boston Globe uncovered the massive scandal of child molestation and cover-up within the local Catholic Archdiocese, shaking the entire Catholic Church to its core./
Leaf
tt6966692 GreenBook, ranking 132 among the top 250 movies. Its a Biography, Comedy, Drama movie in 2018, directed by Peter Farrelly, having a runtime of 130min, and rated PG-13.***The movie is about: A working-class Italian-American bouncer becomes the driver for an African-American classical pianist on a tour of venues through the 1960s American South./
Internal node
Do you want an R-rated movie?
Leaf
tt6710474 EverythingEverywhereAllatOnce, ranking 245 among the top 250 movies. Its a Action, Adventure, Comedy movie in 2022, directed by Dan Kwan, having a runtime of 139min, and rated R.***The movie is about: An aging Chinese immigrant is swept up in an insane adventure, in which she alone can save the world by exploring other universes connecting with the lives she could have led./
Leaf
tt1454029 TheHelp, ranking 249 among the top 250 movies. Its a Drama movie in 2011, directed by Tate Taylor, having a runtime of 146min, and rated PG-13.***The movie is about: An aspiring author during the civil rights movement of the 1960s decides to write a book detailing the African American maids' point of view on the white families for which they work, and the hardships they go through on a daily b.../
Leaf
None
Leaf
None
Internal node
Do you want a long movie?
Internal node
Do you want a movie directed by a famous director?
Leaf
None
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt0395169 HotelRwanda, ranking 209 among the top 250 movies. Its a Biography, Drama, History movie in 2004, directed by Terry George, having a runtime of 121min, and rated PG-13.***The movie is about: Paul Rusesabagina, a hotel manager, houses over a thousand Tutsi refugees during their struggle against the Hutu militia in Rwanda, Africa./
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt1255953 Incendies, ranking 111 among the top 250 movies. Its a Drama, Mystery movie in 2010, directed by Denis Villeneuve, having a runtime of 131min, and rated R.***The movie is about: Twins journey to the Middle East to discover their family history and fulfill their mother's last wishes./tt0363163 Downfall, ranking 124 among the top 250 movies. Its a Biography, Drama, History movie in 2004, directed by Oliver Hirschbiegel, having a runtime of 156min, and rated R.***The movie is about: Traudl Junge, the final secretary for Adolf Hitler, tells of the Nazi dictator's final days in his Berlin bunker at the end of WWII./tt1979320 Rush, ranking 218 among the top 250 movies. Its a Action, Biography, Drama movie in 2013, directed by Ron Howard, having a runtime of 123min, and rated R.***The movie is about: The merciless 1970s rivalry between Formula One rivals James Hunt and Niki Lauda./
Internal node
Do you want a crime movie?
Leaf
tt0353969 MemoriesofMurder, ranking 196 among the top 250 movies. Its a Crime, Drama, Mystery movie in 2003, directed by Bong Joon Ho, having a runtime of 132min, and rated Not Rated.***The movie is about: In a small Korean province in 1986, two detectives struggle with the case of multiple young women being found raped and murdered by an unknown culprit./
Leaf
tt1187043 3Idiots, ranking 85 among the top 250 movies. Its a Comedy, Drama movie in 2009, directed by Rajkumar Hirani, having a runtime of 170min, and rated PG-13.***The movie is about: Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them "idiots"./tt8503618 Hamilton, ranking 107 among the top 250 movies. Its a Biography, Drama, History movie in 2020, directed by Thomas Kail, having a runtime of 160min, and rated PG-13.***The movie is about: The real life of one of America's foremost founding fathers and first Secretary of the Treasury, Alexander Hamilton. Captured live on Broadway from the Richard Rodgers Theater with the original Broadway cast./tt5074352 Dangal, ranking 126 among the top 250 movies. Its a Action, Biography, Drama movie in 2016, directed by Nitesh Tiwari, having a runtime of 161min, and rated Not Rated.***The movie is about: Former wrestler Mahavir Singh Phogat and his two wrestler daughters struggle towards glory at the Commonwealth Games in the face of societal oppression./tt1291584 Warrior, ranking 168 among the top 250 movies. Its a Action, Drama, Sport movie in 2011, directed by Gavin O'Connor, having a runtime of 140min, and rated PG-13.***The movie is about: The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament - a path that puts the fighter on a collision course with his estranged, older brother./
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
None
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt0405094 TheLivesofOthers, ranking 58 among the top 250 movies. Its a Drama, Mystery, Thriller movie in 2006, directed by Florian Henckel von Donnersmarck, having a runtime of 137min, and rated R.***The movie is about: In 1984 East Berlin, an agent of the secret police, conducting surveillance on a writer and his lover, finds himself becoming increasingly absorbed by their lives./tt8267604 Capernaum, ranking 90 among the top 250 movies. Its a Drama movie in 2018, directed by Nadine Labaki, having a runtime of 126min, and rated R.***The movie is about: While serving a five-year sentence for a violent crime, a 12-year-old boy sues his parents for neglect./tt1305806 TheSecretinTheirEyes, ranking 163 among the top 250 movies. Its a Drama, Mystery, Romance movie in 2009, directed by Juan José Campanella, having a runtime of 129min, and rated R.***The movie is about: A retired legal counselor writes a novel hoping to find closure for one of his past unresolved homicide cases and for his unreciprocated love with his superior - both of which still haunt him decades later./tt3011894 WildTales, ranking 197 among the top 250 movies. Its a Comedy, Drama, Thriller movie in 2014, directed by Damián Szifron, having a runtime of 122min, and rated R.***The movie is about: Six short stories that explore the extremities of human behavior involving people in distress./tt0245712 AmoresPerros, ranking 237 among the top 250 movies. Its a Drama, Thriller movie in 2000, directed by Alejandro G. Iñárritu, having a runtime of 154min, and rated R.***The movie is about: A horrific car accident connects three stories, each involving characters dealing with loss, regret, and life's harsh realities, all in the name of love./
Internal node
Do you want a crime movie?
Leaf
tt15097216 JaiBhim, ranking 232 among the top 250 movies. Its a Crime, Drama, Mystery movie in 2021, directed by T.J. Gnanavel, having a runtime of 164min, and rated TV-MA.***The movie is about: When a tribal man is arrested for a case of alleged theft, his wife turns to a human-rights lawyer to help bring justice./
Leaf
tt1832382 ASeparation, ranking 115 among the top 250 movies. Its a Drama movie in 2011, directed by Asghar Farhadi, having a runtime of 123min, and rated PG-13.***The movie is about: A married couple are faced with a difficult decision - to improve the life of their child by moving to another country or to stay in Iran and look after a deteriorating parent who has Alzheimer's disease./tt0986264 LikeStarsonEarth, ranking 122 among the top 250 movies. Its a Drama, Family movie in 2007, directed by Aamir Khan, having a runtime of 165min, and rated PG.***The movie is about: An eight-year-old boy is thought to be a lazy trouble-maker, until the new art teacher has the patience and compassion to discover the real problem behind his struggles in school./tt4016934 TheHandmaiden, ranking 240 among the top 250 movies. Its a Drama, Romance, Thriller movie in 2016, directed by Park Chan-wook, having a runtime of 145min, and rated Not Rated.***The movie is about: A woman is hired as a handmaiden to a Japanese heiress, but secretly she is involved in a plot to defraud her./
Internal node
Do you want a movie directed by a famous director?
Leaf
tt0347149 Howl'sMovingCastle, ranking 164 among the top 250 movies. Its a Animation, Adventure, Family movie in 2004, directed by Hayao Miyazaki, having a runtime of 119min, and rated PG.***The movie is about: When an unconfident young woman is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking castle./
Internal node
Do you want a movie acted by Hollywood super stars?
Leaf
None
Internal node
Do you want a movie in English?
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
tt10272386 TheFather, ranking 130 among the top 250 movies. Its a Drama, Mystery movie in 2020, directed by Florian Zeller, having a runtime of 97min, and rated PG-13.***The movie is about: A man refuses all assistance from his daughter as he ages. As he tries to make sense of his changing circumstances, he begins to doubt his loved ones, his own mind and even the fabric of his reality./
Internal node
Do you want an R-rated movie?
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt2106476 TheHunt, ranking 94 among the top 250 movies. Its a Drama movie in 2012, directed by Thomas Vinterberg, having a runtime of 115min, and rated R.***The movie is about: A teacher lives a lonely life, all the while struggling over his son's custody. His life slowly gets better as he finds love and receives good news from his son, but his new luck is about to be brutally shattered by an innocent li.../tt3170832 Room, ranking 200 among the top 250 movies. Its a Drama, Thriller movie in 2015, directed by Lenny Abrahamson, having a runtime of 118min, and rated R.***The movie is about: Held captive for 7 years in an enclosed space, a woman and her young son finally gain their freedom, allowing the boy to experience the outside world for the first time./tt0381681 BeforeSunset, ranking 223 among the top 250 movies. Its a Drama, Romance movie in 2004, directed by Richard Linklater, having a runtime of 80min, and rated R.***The movie is about: Nine years after Jesse and Celine first met, they encounter each other again on the French leg of Jesse's book tour./
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt4729430 Klaus, ranking 190 among the top 250 movies. Its a Animation, Adventure, Comedy movie in 2019, directed by Sergio Pablos, having a runtime of 96min, and rated PG.***The movie is about: A simple act of kindness always sparks another, even in a frozen, faraway place. When Smeerensburg's new postman, Jesper, befriends toymaker Klaus, their gifts melt an age-old feud and deliver a sleigh full of holiday traditions./tt0978762 MaryandMax, ranking 201 among the top 250 movies. Its a Animation, Comedy, Drama movie in 2009, directed by Adam Elliot, having a runtime of 92min, and rated Not Rated.***The movie is about: A tale of friendship between two unlikely pen pals: Mary, a lonely, eight-year-old girl living in the suburbs of Melbourne, and Max, a forty-four-year old, severely obese man living in New York./tt1028532 Hachi:ADog'sTale, ranking 230 among the top 250 movies. Its a Biography, Drama, Family movie in 2009, directed by Lasse Hallström, having a runtime of 93min, and rated G.***The movie is about: A college professor bonds with an abandoned dog he takes into his home./
Internal node
Do you want a movie that has been nominated the Oscar Award?
Leaf
None
Internal node
Do you want an R-rated movie?
Leaf
None
Internal node
Do you want a crime movie?
Leaf
None
Leaf
tt5311514 YourName., ranking 82 among the top 250 movies. Its a Animation, Drama, Fantasy movie in 2016, directed by Makoto Shinkai, having a runtime of 106min, and rated TV-PG.***The movie is about: Two strangers find themselves linked in a bizarre way. When a connection forms, will distance be the only thing to keep them apart?/tt0476735 MyFatherandMySon, ranking 236 among the top 250 movies. Its a Drama, Family movie in 2005, directed by Çagan Irmak, having a runtime of 112min, and rated Not Rated.***The movie is about: The family of a left-wing journalist is torn apart after the military coup of Turkey in 1980./
